# **ORDER BY CLAUSE**

The SQL **ORDER BY** clause sort the records in ascending or descending order, based on one or more columns. Some databases sort the query results in ascending order by default.

Using the **ORDER BY** clause, we can sort the records in ascending or descending order as per our requirement. The records will get sorted in ascending order whenever the **ASC keyword** is used with ORDER by clause. **DESC keyword** will sort the records in descending order. If no keyword is specified after the column based on which we have to sort the records, in that case, the sorting will get done by default in the ascending order.

In [ ]:
""" The ORDER BY keyword sort the database records in ascending or descending order.
    The ORDER BY keyword sorts the records in ascending order by default. To sort the records in descending order, use the DESC keyword. """

# ORDER BY Syntax:

SELECT column1, column2, ...
FROM table_name
[WHERE condition(s)]
[ORDER BY column1, column2, .. columnN] [ASC | DESC];

# `ORDER BY` specifies the order in which the records will get displayed.
# `ASC` orders the records in ascending order (By Default).
# `DESC` orders the records in descending order.

## **Example**

Consider the CUSTOMERS table having the following records:

`Table 1: CUSTOMERS`

| ID | NAME     | AGE | ADDRESS   | SALARY   |
|----|:---------|:----|:----------|:---------|
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
|  2 | Khilan   |  25 | Delhi     |  1500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  4 | Chaitali |  25 | Mumbai    |  6500.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |

### Solution 1:

The following code block sorts the result in ascending order by the `NAME` and `SALARY`.

> `SELECT * FROM CUSTOMERS ORDER BY NAME ASC, SALARY ASC;`

| ID | NAME     | AGE | ADDRESS   | SALARY   |
|----|:---------|:----|:----------|:---------|
|  4 | Chaitali |  25 | Mumbai    |  6500.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  2 | Khilan   |  25 | Delhi     |  1500.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |

### Solution 2:

The following code block sorts the result in descending order by `NAME`.

> `SELECT * FROM CUSTOMERS ORDER BY NAME DESC;`

| ID | NAME     | AGE | ADDRESS   | SALARY   |
|----|:---------|:----|:----------|:---------|
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  2 | Khilan   |  25 | Delhi     |  1500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  4 | Chaitali |  25 | Mumbai    |  6500.00 |

# **GROUP BY CLAUSE**

The SQL **GROUP BY** clause is used in collaboration with the **SELECT** statement to arrange identical data into groups. This **GROUP BY** clause follows the **WHERE** clause in a **SELECT** statement and precedes the **ORDER BY** clause.

### **Explanation:**

The **SELECT** statement containing a **GROUP BY** clause gets evaluated.

*   The **SELECT** clause specifies the columns to be retrieved.
*   The **FROM** clause specifies the tables that the database must access.
*   The **WHERE** clause specifies the rows to be retrieved. If there is no **WHERE** clause, all rows will be retrieved by default.
*   The **GROUP BY** clause specifies how the rows should get grouped.

In [ ]:
""" The GROUP BY statement groups records that have the same values into summary rows.
    The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns. """

# GROUP BY Syntax:

SELECT column1, column2, ...
FROM table_name
[WHERE condition(s)]
[GROUP BY column1, column2, .. columnN]
[ORDER BY column1, column2, .. columnN] [ASC | DESC];

## **Example**

Consider the CUSTOMERS table having the following records:

`Table 1: CUSTOMERS`

| ID | NAME     | AGE | ADDRESS   | SALARY   |
|----|:---------|:----|:----------|:---------|
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
|  2 | Ramesh   |  25 | Delhi     |  1500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  4 | kaushik  |  25 | Mumbai    |  6500.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |

### Solution 1:

The following code block groups the result to extract the total amount of salary for each customer.

> `SELECT NAME, SUM(SALARY) FROM CUSTOMERS GROUP BY NAME;`

| NAME    | SUM(SALARY) |
|:--------|:------------|
| Hardik  |     8500.00 |
| kaushik |     8500.00 |
| Komal   |     4500.00 |
| Muffy   |    10000.00 |
| Ramesh  |     3500.00 |

# **HAVING CLAUSE**

The **HAVING** clause enables us to specify conditions that filter which group results appear in the results. The **WHERE** clause places conditions on the selected columns, whereas the **HAVING** clause places conditions on groups created by the **GROUP BY** clause.

In the same way, we use the **WHERE** clause to restrict the rows that we select, we can use the **HAVING** clause to restrict groups. When we use the **HAVING** clause, the database restricts the groups as follows:

*   Rows are grouped.
*   The group function is applied.
*   Groups matching the HAVING clause are displayed.

In [ ]:
""" The HAVING clause must follow the GROUP BY clause in a query and precede the ORDER BY clause (if used).
    The following code block has the syntax of the SELECT statement, including the HAVING clause. """

# HAVING Syntax.

SELECT column_name(s)
FROM table_name
WHERE [condition]
GROUP BY column_name(s)
HAVING [condition]
ORDER BY column_name(s);

## **Example**

Consider the CUSTOMERS table having the following records:

`Table 1: CUSTOMERS`

| ID | NAME     | AGE | ADDRESS   | SALARY   |
|----|:---------|:----|:----------|:---------|
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
|  2 | Khilan   |  25 | Delhi     |  1500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  4 | Chaitali |  25 | Mumbai    |  6500.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |

### Solution 1:

Following is an example that would display a record for a similar age count that would be more than or equal to 2.

> `SELECT ID, NAME, AGE, ADDRESS, SALARY FROM CUSTOMERS GROUP BY age HAVING COUNT(age) >= 2;`

| ID | NAME   | AGE | ADDRESS | SALARY  |
|:---|:-------|:----|:--------|:--------|
|  2 | Khilan |  25 | Delhi   | 1500.00 |


## **Difference between WHERE and HAVING Clause.**

The **WHERE** clause specifies a condition for filtering records before any groupings are made. On the contrary, the HAVING clause specifies a condition for filtering values from a group.

The **HAVING** clause in SQL is used in conjunction with the **GROUP BY** clause that specifies conditions to filter which group set appears in the result. It returns only those values from the groups in the final result that fulfills certain conditions. We can also use the **WHERE** and **HAVING** clauses together during selection. In this case, the **WHERE** clause first filters the individual rows, then rows are grouped, performs aggregate calculations, and at last **HAVING** clause filters the groups.

# **UNION CLAUSE**

The SQL **UNION** clause is used to combine the results of two or more **SELECT** statements without returning any duplicate rows.

To use the **UNION** clause, each SELECT statement must have:

*   The same number of columns selected.
*   The same number of column expressions.
*   The same data type.
*   Have them in the same order.
*   But they need not have to be of the same length.

## **Example**

Consider the following two tables CUSTOMERS and ORDERS having the following records:

`Table 1: CUSTOMERS`

| ID | NAME     | AGE | ADDRESS   | SALARY   |
|----|:---------|:----|:----------|:---------|
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
|  2 | Khilan   |  25 | Delhi     |  1500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  4 | Chaitali |  25 | Mumbai    |  6500.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |

`Table 2: ORDERS`

|OID  | DATE                | CUSTOMER_ID | AMOUNT |
|-----|:--------------------|:------------|:-------|
| 102 | 2009-10-08 00:00:00 |           3 |   3000 |
| 100 | 2009-10-08 00:00:00 |           3 |   1500 |
| 101 | 2009-11-20 00:00:00 |           2 |   1560 |
| 103 | 2008-05-20 00:00:00 |           4 |   2060 |

### Solution 1:

Now, let's join these two tables in our SELECT statement as follows:

> `SELECT ID, NAME, AMOUNT, DATE FROM CUSTOMERS LEFT JOIN ORDERS ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID`

> `UNION`

> `SELECT ID, NAME, AMOUNT, DATE FROM CUSTOMERS RIGHT JOIN ORDERS ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;`

| ID   | NAME     | AMOUNT | DATE                |
|:-----|:---------|:-------|:--------------------|
|    1 | Ramesh   |   NULL | NULL                |
|    2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|    3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|    3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|    4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
|    5 | Hardik   |   NULL | NULL                |
|    6 | Komal    |   NULL | NULL                |
|    7 | Muffy    |   NULL | NULL                |

In [ ]:
""" 
The UNION operator is used to combine the result-set of two or more SELECT statements.

    1. Every SELECT statement within UNION must have the same number of columns.
    2. The columns must also have similar data types.
    3. The columns in every SELECT statement must also be in the same order.
"""

# UNION Clause Syntax.

SELECT column_name(s)
FROM table1
[WHERE condition]

UNION

SELECT column_name(s)
FROM table2
[WHERE condition]

# **UNION ALL CLAUSE**

The SQL **UNION ALL** clause is used to combine the results of two **SELECT** statements, including duplicate rows. The rules apply to the **UNION** clause also applies to the **UNION ALL** clause.

## **Example**

Consider the following two tables CUSTOMERS and ORDERS having the following records:

`Table 1: CUSTOMERS`

| ID | NAME     | AGE | ADDRESS   | SALARY   |
|----|:---------|:----|:----------|:---------|
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
|  2 | Khilan   |  25 | Delhi     |  1500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  4 | Chaitali |  25 | Mumbai    |  6500.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |

`Table 2: ORDERS`

|OID  | DATE                | CUSTOMER_ID | AMOUNT |
|-----|:--------------------|:------------|:-------|
| 102 | 2009-10-08 00:00:00 |           3 |   3000 |
| 100 | 2009-10-08 00:00:00 |           3 |   1500 |
| 101 | 2009-11-20 00:00:00 |           2 |   1560 |
| 103 | 2008-05-20 00:00:00 |           4 |   2060 |

### Solution 1:

Now, let's join these two tables in our SELECT statement as follows:

> `SELECT ID, NAME, AMOUNT, DATE FROM CUSTOMERS LEFT JOIN ORDERS ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID`

> `UNION ALL`

> `SELECT ID, NAME, AMOUNT, DATE FROM CUSTOMERS RIGHT JOIN ORDERS ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;`

| ID   | NAME     | AMOUNT | DATE                |
|:-----|:---------|:-------|:--------------------|
|    1 | Ramesh   |   NULL | NULL                |
|    2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|    3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|    3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|    4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
|    5 | Hardik   |   NULL | NULL                |
|    6 | Komal    |   NULL | NULL                |
|    7 | Muffy    |   NULL | NULL                |
|    3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|    3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|    2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|    4 | Chaitali |   2060 | 2008-05-20 00:00:00 |

In [ ]:
""" The UNION operator selects only distinct values by default. To allow duplicate values, we use UNION ALL. """

# UNION ALL Clause Syntax.

SELECT column_name(s)
FROM table1
[WHERE condition]

UNION ALL

SELECT column_name(s)
FROM table2
[WHERE condition]

# **SQL INTERSECT CLAUSE**

SQL **INTERSECT** clause is used to combine two **SELECT** statements but returns rows only from the first **SELECT** statement that are identical to a row in the second **SELECT** statement.

# **SQL EXCEPT CLAUSE**

SQL **EXCEPT** clause combines two **SELECT** statements and returns rows from the first **SELECT** statement that are not returned by the second **SELECT** statement.

# **REFERENCES**

> [SQL Tutorialspoint](https://www.tutorialspoint.com/sql/)

> [SQL W3Schools](https://www.w3schools.com/sql/default.asp)

> [SQL JavaTpoint](https://www.javatpoint.com/sql-tutorial)